// Напишите программу, которая принимает на вход число (N) и выдает таблицу простых чисел от 1 до N.
// 11 -> 2, 3, 5 , 7, 11

// System.Console.Write("Введите число N, что бы вывести таблицу простых чисел от 1 до N = ");
// int N = int.Parse(Console.ReadLine()!);

// for (int i = 2; i <= N; i++)
// {
//     for (int k = 1; k <= 100; k++)

//         if (i % k == 0)
//         {
//             int result = 0;
//             result++;
//             if (result <= 2)
//             {
//                 System.Console.WriteLine(i);
//             }
//         }
// }