// Задача 13 //

System.Console.Write("Введите число, 3-ю цифру которого необходимо вывести = ");
string s = Console.ReadLine();
char[] str = s.ToCharArray();
System.Console.WriteLine("Задача №13 - " + str[2]);
